Revit 2024 API
BuiltInFailures.SiteImportFailures.InvalidBoundaryError Property
 Failed to get a valid boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidBoundaryError { get; }
Visual Basic
Public Shared ReadOnly Property InvalidBoundaryError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidBoundaryError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace